#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-plr"]: Refreshing state... [id=ISB/client/e21b26fc-28ed-4b4c-9f62-a200f6e89781/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/a6b25756-96f8-4840-8ba7-13af00917183]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-hcimweb"]: Refreshing state... [id=ISB/client/e21b26fc-28ed-4b4c-9f62-a200f6e89781/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/8347340d-5031-4a8e-b05b-478753d53e11]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-sa-hibc-service-bc-portal"]: Refreshing state... [id=ISB/client/e21b26fc-28ed-4b4c-9f62-a200f6e89781/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/1b3e4f85-8d99-4079-a6c2-66343a5432be]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-org"]: Refreshing state... [id=ISB/client/e21b26fc-28ed-4b4c-9f62-a200f6e89781/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/904b3f16-bb9c-4ee1-800a-d6528db6670f]
module.COMMON_SSO_DEV.module.ISB.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-metrics"]: Refreshing state... [id=ISB/client/e21b26fc-28ed-4b4c-9f62-a200f6e89781/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/1a6c79cc-31e2-4a4f-8304-9297b2686703]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-pidp-service"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/aaa6aea1-05cd-45ef-883c-c1230ce82220]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-licence-status"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/464f93c4-36bb-47c0-afaa-bed45faff1e0]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/create-user"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/7e4ea70a-637e-4187-9e00-6ce583b12706]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/d5bb7b1f-96ac-4416-8a80-e7ee503c4c40]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/deafcac4-2813-4167-aae1-d8e09131c8b1]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-hcimweb"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/8347340d-5031-4a8e-b05b-478753d53e11]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-prp-service"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/2cfcf3d6-2d38-4ab8-986c-2a5b1e6cad49]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-dmft-webapp"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/8f3769e9-b953-4981-b118-5f8675d6843a]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/manage-user-roles"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/42659cd8-421e-4fb7-814e-1c24af736084]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/manage-user-details"]: Refreshing state... [id=f3004634-6b9e-421a-9065-8f2bfdb3cae5/c3f8f636-d2af-4ada-8304-d5fc3ec9aa42]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-hcimweb"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/8347340d-5031-4a8e-b05b-478753d53e11]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/create-user"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/7e4ea70a-637e-4187-9e00-6ce583b12706]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-details"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/c3f8f636-d2af-4ada-8304-d5fc3ec9aa42]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-prp-service"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/2cfcf3d6-2d38-4ab8-986c-2a5b1e6cad49]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-roles"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/42659cd8-421e-4fb7-814e-1c24af736084]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-licence-status"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/464f93c4-36bb-47c0-afaa-bed45faff1e0]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-pidp-service"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/aaa6aea1-05cd-45ef-883c-c1230ce82220]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/deafcac4-2813-4167-aae1-d8e09131c8b1]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/d5bb7b1f-96ac-4416-8a80-e7ee503c4c40]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-dmft-webapp"]: Refreshing state... [id=ISB/client/d8d8a39c-879f-437b-8eb0-c8e316f8b833/scope-mappings/4c3b3184-cee7-4825-b70a-43800722284c/8f3769e9-b953-4981-b118-5f8675d6843a]
module.COMMON_SSO_DEV.module.ISB.module.MANAGE-USERS.keycloak_role.REALM_ROLE: Refreshing state... [id=a04f8bc6-c321-4e68-8e04-0e4ca7d89c32]
module.COMMON_SSO_DEV.module.ISB.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=23fe2643-8ddf-4d1e-b5be-6200d9b5e30a/6d4a88e3-67ab-4d6f-9db6-a54240dd1260]
module.COMMON_SSO_DEV.module.ISB.module.DMFT-SERVICE.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=ISB/client/af0ce0c6-fc57-4fca-a7e1-53d16244a589/scope-mappings/d8d8a39c-879f-437b-8eb0-c8e316f8b833/6d4a88e3-67ab-4d6f-9db6-a54240dd1260]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=ISB/client/59e70021-0750-4c4f-ac31-81b37c8a9b58/scope-mappings/d0f77a2f-634f-40a6-bb08-48c695a7067f/165fc2fb-009c-4ab6-9352-97ad183372ef]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=ISB/client/59e70021-0750-4c4f-ac31-81b37c8a9b58/scope-mappings/d8d8a39c-879f-437b-8eb0-c8e316f8b833/3cc6663b-fa97-4839-9dda-d9fc85462feb]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=ISB/client/59e70021-0750-4c4f-ac31-81b37c8a9b58/scope-mappings/d8d8a39c-879f-437b-8eb0-c8e316f8b833/55484e84-13f3-4557-b8aa-73d959acf071]
module.COMMON_SSO_DEV.module.ISB.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=ISB/client/59e70021-0750-4c4f-ac31-81b37c8a9b58/scope-mappings/d8d8a39c-879f-437b-8eb0-c8e316f8b833/fdfb6c85-bc99-4ae7-94f1-8aef8953e64a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.COMMON_SSO_DEV.module.ISB.module.azure.keycloak_oidc_identity_provider.this will be updated in-place
  ~ resource "keycloak_oidc_identity_provider" "this" {
      ~ extra_config                            = {
          + "forwardParameters" = ""
          + "tooltip"           = ""
            # (1 unchanged element hidden)
        }
        id                                      = "azure"
        # (25 unchanged attributes hidden)
    }

  # module.COMMON_SSO_DEV.module.ISB.module.ORDS-TOMCAT-CLIENT.module.TOMCAT_OIDC_CLIENT.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = "CONFIDENTIAL"
      + admin_url                                  = (known after apply)
      + backchannel_logout_revoke_offline_sessions = false
      + backchannel_logout_session_required        = true
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = "client-secret"
      + client_id                                  = "ords-tomcat-client"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = false
      + consent_screen_text                        = (known after apply)
      + description                                = "Tomcat OIDC Client for ORDS"
      + direct_access_grants_enabled               = false
      + display_on_consent_screen                  = (known after apply)
      + enabled                                    = true
      + exclude_session_state_from_auth_response   = false
      + frontchannel_logout_enabled                = (known after apply)
      + full_scope_allowed                         = false
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = false
      + import                                     = false
      + name                                       = "tomcat-client"
      + oauth2_device_authorization_grant_enabled  = false
      + realm_id                                   = "ISB"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = false
      + standard_flow_enabled                      = false
      + use_refresh_tokens                         = true
      + use_refresh_tokens_client_credentials      = false
      + valid_post_logout_redirect_uris            = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sookeke, Action: `pull_request`*